return {
	SpinSpin = {
		Z = "หมุน"
	},
	MelodyMelody = {
		Z = "เสียงทะลวงใจ",
		X = "ดิสโก้ครัช",
		C = "บรรเลงสังหาร",
		V = "อาณาเขตสะท้านเสียง",
		E = "ท่วงทำนองเหินเวหา"
	},
	MagmaMagma = {
		Z = "กำปั้นแม๊กม่า",
		X = "หมาล่าเนื้อ",
		C = "พื้นแม็กม่า",
		V = "แม็กม่าดาวตก",
		E = "แม็กม่าบิน",
		ZAwake = "หมัดทั้ง 5",
		XAwake = "หมัดลาวาไขว้",
		CAwake = "แขนลาวายักษ์",
		VAwake = "หมัดสงครามลาวา",
		EAwake = "ขี่กริฟฟิน"
	},
	MammothMammoth = {
		Z = "สแมช",
		X = "ขว้างหิน",
		C = "พุ่งชน",
		V = "กลายร่าง"
	},
	LightLight = {
		Z = "กระสุนแสง",
		X = "ปืนแม็กนั่มแสง",
		C = "กระจกแสง",
		V = "แสงกระหน่ำยิง",
		E = "บินความเร็วแสง",
		ZAwake = "สไนเปอร์ลงทัณฑ์",
		XAwake = "ลำแสงบีม",
		CAwake = "ลูกเตะเทวทูต",
		VAwake = "แสงพิพากษา",
		EAwake = "ความเร็วแสง"
	},
	BombBomb = {
		Z = "ยิง",
		X = "ต่อย",
		C = "ทริปเปิ้ล",
		V = "ระเบิด",
		E = "ระเบิดแดช",
		ZAwake = "ระเบิดจิ๋ว",
		XAwake = "ขว้างระเบิด",
		CAwake = "ระเบิดประทุ",
		VAwake = "ระเบิดปั่นป่วน",
		EAwake = "ระเบิดพุ่งตัว"
	},
	DarkDark = {
		Z = "หินกระหน่ำ",
		X = "หลุมดำ",
		C = "พายุความมืด",
		V = "บอลความมืด",
		B = "ความมืดทำลายล้าง",
		ZAwake = "พลังดูดปีศาจ",
		XAwake = "หลุมดำมหึมา",
		CAwake = "ทอร์นาโดโหมกระหน่ำ",
		VAwake = "บอลมิติความมืด",
		BAwake = "ความมืดทำลายล้าง"
	},
	FlameFlame = {
		Z = "กำปั้นเพลิง",
		X = "เสาเพลิง",
		C = "หิ้งห้อยเพลิง",
		V = "จักรพรรดิเพลิง",
		E = "เพลิงโบยบิน",
		ZAwake = "แมงเม่าบินเข้ากองเพลิง",
		XAwake = "ป้อมปราการมหาเพลิง",
		CAwake = "ปืนกล",
		VAwake = "ทรราชนรก",
		EAwake = "เครื่องบินเจ็ท"
	},
	HumanHuman = {
		Z = "พายุคลื่น",
		X = "หินจิตวิญญาณ",
		C = "พื้นทรงพลัง",
		V = "เวหาจิต"
	},
	GravityGravity = {
		Z = "พื้นแรงโน้มถ่วง",
		X = "อุกกาบาต",
		C = "หินเหาะ",
		V = "ฝนอุกกาบาต",
		B = "หินแรงโน้มถ่วง",
		ZAwake = "แรงกดดัน",
		XAwake = "อุกกาบาต",
		CAwake = "หินโน้มถ่วง",
		VAwake = "อุกกาบาตพลูเวีย",
		BAwake = "รุยนา"
	},
	IceIce = {
		Z = "นกพิราบน้ำแข็ง",
		X = "น้ำแข็งกระหน่ำยิง",
		C = "น้ำแข็งทิ่มแทง",
		V = "พื้นน้ำแข็ง",
		E = "เซิร์ฟน้ำแข็ง",
		ZAwake = "เสือพยักษ์น้ำแข็ง",
		XAwake = "กระสุนหนามน้ำแข็ง",
		CAwake = "น้ำแข็งศักสิทธ์",
		VAwake = "สงครามน้ำแข็ง",
		EAwake = "นกน้ำแข็งอัญเชิญ"
	},
	PawPaw = {
		Z = "อุ้งตีนจิ๋ว",
		X = "กระหน่ำอุ้งตีน",
		C = "อุ้งตีนผ่าพสุธา",
		V = "อุ้งตีนปะทุ",
		B = "อุ้งตีนทำลายล้าง"
	},
	GumGum = {
		Z = "ปืนครก",
		X = "ปืนใหญ่",
		C = "รัวกระสุน",
		V = "แปลงร่าง",
		E = "เหาะเหิน",
		ZSecond = "เหยี่ยวเพลิง",
		XSecond = "ปืนใหญ่เทอร์โบ",
		CSecond = "รัวกระสุนเจ็ท",
		VSecond = "แปลงร่าง",
		ESecond = "สุดยอดเหาะเหิน",
		ZThird = "งูเพลิงนรก",
		XThird = "งูเงา",
		CThird = "รัวกระสุนงู",
		VThird = "แปลงร่าง",
		EThird = "อัลตร้าเหาะเหิน"
	},
	PhoenixPhoenix = {
		Z = "ทุบ",
		X = "ฟื้นฟู",
		C = "ลูกเตะ",
		V = "ร่างเต็ม",
		E = "โบยบิน"
	},
	PhoenixPhoenixSecond = {
		Z = "ทุบหนัก",
		X = "ฟื้นฟูแข็งแกร่ง",
		C = "ลูกเตะวิญญาณ",
		V = "มนุษย์",
		E = "โบยบิน"
	},
	MammothMammothSecond = {
		Z = "สแมชพื้น",
		X = "หินยักษ์",
		C = "พุ่งชน",
		V = "มนุษย์"
	},
	RumbleRumble = {
		Z = "ช็อตไฟฟ้า",
		X = "ธันเดอร์บีม",
		C = "สกายธันเดอร์",
		V = "บอลทมิฬ",
		E = "อิเล็กโทรพอทเทชั่น",
		ZAwake = "อสนีบาต",
		XAwake = "มรสุมพิฆาต",
		CAwake = "พยัคฆ์สถิต",
		VAwake = "คลื่นพิพากษ์",
		EAwake = "คลื่นสลับ"
	},
	PeodizSpec = {
		Z = "งานใบมีดไม่ จำกัด",
		X = "วอลเล่ย์ดาบ",
		C = "โร ไออัส",
		V = "อาวุธในตำนาน"
	},
	DragonDragon = {
		Z = "กระสุนนรก",
		X = "มหาวิบัติ",
		C = "มังกรผู้ข่มขวัญ",
		V = "อภินิหารมังกร",
		E = "ลมหายใจมังกร"
	},
	SandSand = {
		Z = "กระสุนทราย",
		X = "ทรายทิ่มแทง",
		C = "ทรายดูด",
		V = "พายุทราย",
		E = "ทรายโบยบิน"
	},
	WolfWolf = {
		Z = "กลายร่าง",
		X = "ลูกเตะต่อเนื่อง",
		C = "ลูกเตะสลาตัน",
		V = "คืนพระจันทร์เต็มดวง"
	},
	GiraffeGiraffe = {
		Z = "กลายร่าง",
		X = "พินาศปะทะ",
		C = "กระเพื่อม",
		V = "โยกสนั่น"
	},
	LeopardLeopard = {
		Z = "กลายร่าง",
		X = "พุ่งชน",
		C = "ลำแสง",
		V = "คำราม",
		E = "กระสุนไฟ"
	},
	BuddhaBuddha = {
		Z = "กลายร่าง",
		X = "ทุบพื้น",
		C = "กระทืบ",
		V = "ระเบิด",
		ZAwake = "แปลงร่างเทวะ",
		XAwake = "ประทับศักดิ์สิทธิ์",
		CAwake = "มนต์อัศจรรย์",
		VAwake = "รังสีแห่งศรัทธา",
		EAwake = "ย่ำกระหม่อม"
	},
	OpOp = {
		Z = "อาณาเขต",
		X = "หิน",
		C = "ขโมยหัวใจ",
		V = "แกมม่า",
		E = "เคาน์เตอร์ช็อค",
		B = "เทเลพอร์ต",
		ZAwake = "อำนาจอิสระ",
		XAwake = "ศิลาประดิษฐ์",
		CAwake = "ช็อตแห่งชีวิต",
		VAwake = "เสาหินพิทักษ์",
		EAwake = "ตัดบรรจบ",
		BAwake = "วิถีมิติ"
	},
	VenomVenom = {
		Z = "ยิง",
		X = "ไฮดรา",
		C = "ไฮดราสามหัว",
		V = "ปีศาจ",
		B = "ไฮดราเคลื่อนที่",
		ZAwake = "ยิงรัว",
		XAwake = "ไฮดรา ทำลายล้าง",
		CAwake = "ไฮดรา จู่โจม",
		VAwake = "ร่างปีศาจ",
		BAwake = "เทเลพอร์ต",
		EAwake = "บ่องูพิษ"
	},
	LoveLove = {
		Z = "ปืนพก",
		X = "น่ารัก",
		C = "ศรบริวาร",
		V = "ลูกเตะเฮอริเคน",
		ZAwake = "พันธะบรรลัย",
		XAwake = "พันธะพิฆาต",
		CAwake = "อัสนีพิศวาส",
		VAwake = "มลักมรสุม"
	},
	BarrierBarrier = {
		Z = "ผลัก",
		X = "ตบลง",
		C = "บันได",
		V = "ทิ่มแทง",
		E = "หมัดปืนพกบาเรีย"
	},
	ShadowShadow = {
		Z = "เงาปะทุ",
		X = "ค้างคาวเงา",
		C = "ระเบิดเงา",
		V = "เงาเทเลพอร์ต",
		ZAwake = "เงาปะทุ",
		XAwake = "ค้างคาวเงา",
		CAwake = "ระเบิดเงา",
		VAwake = "เงาเทเลพอร์ต",
		EAwake = "หมีเงา"
	},
	SpikeSpike = {
		Z = "หนามมิสไซล์",
		X = "สไปค์รีช",
		C = "สไปค์สแลช",
		V = "บอลหนาม"
	},
	SmokeSmoke = {
		Z = "หมัดควัน",
		X = "งูควัน",
		C = "พื้นควัน",
		V = "ไวท์ไฮดร้า",
		E = "บิน"
	},
	QuakeQuake = {
		Z = "แคร็กบอล",
		X = "ทุบพื้น",
		C = "ทำลายล้าง",
		V = "ดับเบิ้ลเวฟ",
		B = "จุดจบ"
	},
	StringString = {
		Z = "สายรุ้ง",
		X = "กระสุนด้าย",
		C = "แซ้ความร้อน",
		V = "ด้ายจองจำ",
		E = "ด้ายเดินทาง"
	},
	SnowSnow = {
		Z = "ลมหายใจหิมะ",
		X = "บอลจองจำ",
		C = "พายุหิมะ",
		V = "ฟริโกคิเนซิส",
		E = "เคลื่อนย้าย",
		ZAwake = "จักรหิมะ",
		XAwake = "พายุบัลเล่ต์",
		CAwake = "ฟรอสต์การ์ด",
		VAwake = "โซนพายุหิมะ",
		EAwake = "ปีกหิมะ"
	},
	TreeTree = {
		Z = "พฤกษาทะลวงพิภพ",
		X = "สุสานหนามกลืนชีพ",
		C = "พฤกษากลืนกิน",
		V = "แปลงร่าง",
		E = "ร่างปีกพงไพร"
	},
	TreeTreeSecond = {
		Z = "จันทร์เสี้ยวป่าคลั่ง",
		X = "มหาวิบัติพงไพร",
		C = "ดาวพฤกษา",
		V = "มนุษย์",
		E = "ฝนรากคลั่ง"
	},
	DemonDemon = {
		Z = "กระหน่ำโลกันต์",
		X = "หมัดโลกันต์พุ่ง",
		C = "พิโรธระเบิด",
		V = "แปลงร่าง",
		E = "เหาะเพลิง"
	},
	DemonDemonSecond = {
		Z = "ลูกบอลปีศาจ",
		X = "ข่วนอเวจี",
		C = "ฝ่ามือเพลิงนรก",
		V = "มนุษย์",
		E = "สิ้นพิภพนรก"
	},
	AlloAllo = {
		Z = "กระโจนอำมหิต",
		X = "เพลิงซัด",
		C = "คำรามจ่าฝูง",
		V = "แปลงร่าง",
		E = "สปินเวหา"
	},
	AlloAlloSecond = {
		Z = "พุ่งนักล่า",
		X = "โค้งเพลิงนรก",
		C = "คำรามอสูร",
		V = "มนุษย์",
		E = "วังวนจ่าฝูง"
	},
	SpinoSpino = {
		Z = "คลั่งข่วนสังหาร",
		X = "คลื่นคำรามพินาศ",
		C = "คลื่นคำรามดึกดำบรรพ์",
		V = "แปลงร่าง",
		E = "กลิ้งทำลาย"
	},
	SpinoSpinoSecond = {
		Z = "ขย้ำสังหาร",
		X = "คำรามสยอง",
		C = "เสียงข่มโลก",
		V = "มนุษย์",
		E = "กลิ้งบดขยี้"
	},
	PterPter = {
		Z = "คลื่นพิฆาต",
		X = "เพลิงม่วงพินาศ",
		C = "พุ่งเผาผลาญ",
		V = "แปลงร่าง",
		E = "ประตูพิภพแตก"
	},
	PterPterSecond = {
		Z = "คมคลื่นอสูร",
		X = "ลมหายใจอสูรม่วง",
		C = "พุ่งอสูรเพลิง",
		V = "มนุษย์",
		E = "ฝนดาวพินาศ"
	},
	DoughDough = {
		Z = "หมัดยืดหยุ่น",
		X = "กระสุนความร้อน",
		C = "ลิควิดดรอป",
		V = "กระหน่ำต่อย",
		B = "หนามกระบอง",
		E = "โดว์สปิน",
		ZAwake = "กำปั้นเด้ง",
		XAwake = "ขีปนาวุธแป้งโด",
		CAwake = "กับดักเหนียว",
		VAwake = "หมัดเหนียวจู่โจม",
		BAwake = "โมจิอาละวาด",
		EAwake = "โดนัทหนามกลิ้ง"
	},
	BrachioBrachio = {
		Z = "โหม่งสลาย",
		X = "ลูกไฟไดโน",
		C = "พสุธาถล่ม",
		V = "แปลงร่าง",
		E = "หมุนเวหา"
	},
	BrachioBrachioSecond = {
		Z = "โขกปืนใหญ่",
		X = "เพลิงถล่ม",
		C = "กลิ้งพิฆาต",
		V = "มนุษย์",
		E = "อสูรเวหา"
	},
	GasGas = {
		Z = "แฟรี่คัท",
		X = "ลำแสงพิฆาต",
		C = "ระเบิด",
		V = "โซนแก๊ส",
		E = "โบยบิน"
	},
	SpiritSpirit = {
		Z = "อัญเชิญสัตว์เลี้ยง",
		X = "สายฟ้า",
		C = "พ่นไฟ",
		V = "ฟ้าผ่ายักษ์",
		E = "ขี่เมฆ",
		B = "เสาอัคคี"
	},
	MagnetMagnet = {
		Z = "ทั่งกลโลกันต์",
		X = "ลำแสงโพลาร์",
		C = "แฝดกล",
		V = "หัตถ์กล",
		B = "โลหะโทสะ"
	},
	GoldGold = {
		Z = "อัศจรรย์ลั่นไก",
		X = "หมัดมหาศาล",
		C = "สุวรรณซัดหมอบ",
		V = "โซ่แห่งโชคชตา",
		E = "เมืองทองธานี"
	},
	ToyToy = {
		Z = "กระสุนพิทักษ์",
		X = "นภาคุมขัง",
		C = "กำนัลตรธาน",
		V = "ประทัดเหินฟ้า",
		E = "ผงก-อสูร",
		ZRex = "กร้าวสะเทือน",
		XRex = "วันสิ้นโลกา",
		CRex = "กำนัลตรธาน",
		VRex = "ล้างผลาญ",
		ERex = "ยุติ-อสูร"
	},
	GateGate = {
		Power = "Gate",
		Z = "กะซวกมิติ",
		X = "กระชากมิติ",
		C = "มิติบิดเบี้ยว",
		V = "เอกภพบรรลัยกัลป์",
		E = "มิติพเนจร"
	}
}