return {
	Pyreblade = {
		Z = "อัคคีพิโรธ",
		X = "ราชันเพลิง"
	},
	["Basic Rod"] = {
		Z = "บ่วงวารี",
		X = "เหยื่อพิฆาต"
	},
	Sonata = {
		Z = "บรรเลงอารักษ์",
		X = "ทำนองปะทุ"
	},
	Dawnbreaker = {
		Z = "วายุอัคคี",
		X = "ทะลวงอัคนี"
	},
	["Bloodshell Edge"] = {
		Z = "คมเปลวพิฆาต",
		X = "ขานโลกันต์"
	},
	Shellreaper = {
		Z = "ฉีกกระชาก",
		X = "บดขยี้"
	},
	["Abyssal Crab Axe"] = {
		Z = "กระแสหมุนพลังคลื่น",
		X = "พิโรธมหาสมุทร"
	},
	["Draken Fangs"] = {
		Z = "คมดาบมังกรคู่",
		X = "มังกรเวหาพิโรธ"
	},
	Bisento = {
		Z = "วังวน คลื่นวารี",
		X = "วารีพินาศ"
	},
	["Hunter Blade"] = {
		Z = "นักล่า ฟาดฟัน",
		X = "ดาบศักดิ์สิทธิ์"
	},
	["Bloodmoon Twins"] = {
		Z = "อาฆาตฟาดฟัน",
		X = "ตัดพระจันทร์โลหิต"
	},
	["Twin Surge"] = {
		Z = "ผ่าคลื่นนภา",
		X = "วายุเพลิงพิโรธ"
	},
	Ethereal = {
		Z = "ผ่าสวรรค์",
		X = "สายฟ้าแลบเพลิงนรก"
	},
	["Bone Scythe"] = {
		Z = "วายุเคียวทมิฬ",
		X = "ลำแสงยมทูต"
	},
	["Triple Hunter Blade"] = {
		Z = "นักล่า ฟาดฟัน",
		X = "ดาบศักดิ์สิทธิ์ 3 ทบ"
	},
	["Triple Saber"] = {
		Z = "พินาศเฉือนคม",
		X = "พิฆาตสูญสิ้น"
	},
	["Adventure Knife"] = {
		Z = "จักรเพลิงพิฆาต",
		X = "เกลียวเพลิงสังหาร"
	},
	Acroscyth = {
		Z = "ความบ้าคลั่ง",
		X = "วังวนเลือด"
	},
	Acrodagger = {
		Z = "ก้าวปีศาจสังหาร",
		X = "พุ่งโลหิตคลั่ง"
	},
	Acrospear = {
		Z = "โลหิดทิ่มแทง",
		X = "ปะทุพยาบาท"
	},
	Longaevus = {
		Z = "ดาวทำลายล้าง",
		X = "ประตูเเห่งการทำลาย"
	},
	["Anubis Axe"] = {
		Z = "ต่อต้านพระเจ้า",
		X = "พระเจ้าลงทันฑ์"
	},
	["Authentic Triple Katana"] = {
		Z = "ลมกรดเฉือน",
		X = "ใบมีดลม",
		ZAwake = "คมอัสดง",
		XAwake = "พิภพพินาศ"
	},
	Katana = {
		Z = "เพลงดาบเดียว",
		X = "สายลม"
	},
	["Mini Mace"] = {
		Z = "อัสนีกระสุน",
		X = "อัสนีกระแทก"
	},
	Pipe = {
		Z = "เหล็กปะทุ",
		X = "เหล็กทะลุ"
	},
	Pole = {
		Z = "เศียรมังกร",
		X = "พายุสายฟ้าฟาด"
	},
	["Shark Blade"] = {
		Z = "วังวนพายุ",
		X = "ทุบทำลาย"
	},
	["Tashi Blade"] = {
		Z = "หมุน",
		X = "เฉือน"
	},
	["Triple Katana"] = {
		Z = "สามคลื่นวายุ",
		X = "เพลงดาบพายุ"
	},
	Saber = {
		Z = "มังกรคำราม",
		X = "ดาบศักดิ์สิทธิ์",
		ZAwake = "พินาศเฉือนคม",
		XAwake = "พิฆาตสูญสิ้น"
	},
	["Mom Blade"] = {
		Z = "ประดุจคมดาบ",
		X = "นรกคำราม"
	},
	["Xmas Blade"] = {
		Z = "คลื่นดาบปีใหม่",
		X = "ของขวัญบรรลัยกัลป์"
	},
	["Night Blade"] = {
		Z = "ตวัดฟันว่องไว",
		X = "ฟันผ่าอสูร",
		ZAwake = "คลื่นตัดไร้ตัวตน",
		XAwake = "ตัดกาลเวลา"
	},
	Kioru = {
		Z = "คมสลายอณู",
		X = "ช็อตสะท้าน"
	},
	["Kioru V2"] = {
		Z = "คมสายฟ้า",
		X = "ทะลวงจิตใจ"
	},
	["Riptide Slayer"] = {
		Z = "ระเบิดวารี",
		X = "คลื่นยักษ์วารี"
	},
	Jitter = {
		Z = "ปะทุฟาดฟัน",
		X = "ปะทุกระแทก"
	},
	["Hell Sword"] = {
		Z = "ดาบตัดนรก",
		X = "ดาบผ่านรก"
	},
	["Authentic Mace"] = {
		Z = "สายฟ้าสวรรค์",
		X = "ทำนองสายฟ้า"
	},
	["Phoenix Blade"] = {
		Z = "ฟินิกซ์ฟื้นคืน",
		X = "โหมดพระเจ้า",
		ZAwake = "ควิกช็อต",
		XAwake = "โหมดพระเจ้าที่แท้จริง"
	},
	["Metal Trident"] = {
		Z = "โซนิค ลีป",
		X = "หอกดาวตก"
	},
	["Cookie Sword"] = {
		Z = "กระหน่ำแทง",
		X = "วอร์พอล สไตรค์"
	},
	["Sunken Blade"] = {
		Z = "บอลวารี",
		X = "ผ่าวารี"
	},
	["Pumpkin Smasher"] = {
		Z = "แฮมเมอร์ สปินส์",
		X = "โซลิด เบรค"
	},
	["Sweet Lozenge"] = {
		Z = "อินเทอริทัส",
		X = "ครูเดลิส สไลซ์"
	},
	Muramasa = {
		Z = "ไฟที่แตกสลาย",
		X = "วานิชชิ่ง ทรัช",
		ZAwake = "ไฟนิรันดร์",
		XAwake = "คมดาบแห่งหายนะ"
	},
	["Soul Cane"] = {
		Z = "แทงเยือกเย็น",
		X = "กาลยะเยือก"
	},
	["Gold Spear"] = {
		Z = "หวั่นโลกา",
		X = "ตรวนฉับพลัน"
	},
	Apollos = {
		Z = "บทเพลงแห่งความพินาศ",
		X = "วิมานกรีดแทง"
	},
	["Pondere Blade"] = {
		Z = "พุ่งผลุนผลัน",
		X = "ถ่วงปฐพี"
	},
	["Barbaric Axe"] = {
		Z = "พินาศปรามาส",
		X = "ฟาดวิปลาส"
	},
	["Demon Trident"] = {
		Z = "อุทกวายุ",
		X = "ฉลามบุก"
	},
	["Aquatic Anchor"] = {
		Z = "อุทกอาคม",
		X = "อุทกปะทุ"
	},
	["Daybreak Cleaver"] = {
		Z = "กัมปนาทสลาตัน",
		X = "อัสนีวิบัติ"
	},
	["Scepters of Flame"] = {
		Z = "มนตร์พิทักษ์",
		X = "เพลิงคำราม"
	},
	["Cerulean Blossom"] = {
		Z = "ดอกไม้ในหน้าหนาว",
		X = "เมื่อยามดอกไม้บาน"
	},
	["Ancient Sword"] = {
		Z = "พุ่งทลวง",
		X = "โล่แห่งชีวิต"
	},
	["Dragons Standard"] = {
		Z = "ไตรพินาศ",
		X = "อาณัติหาญกล้า"
	},
	Avalon = {
		Z = "บทลงโทษจากสวรรค์",
		X = "พรจากนางฟ้า"
	},
	Noirceur = {
		Z = "ความว่างเปล่า",
		X = "การปะทุที่ชั่วร้าย"
	}
}