return {
	DarkLeg = {
		Power = "ขาดำ",
		Z = "บดขยี้",
		X = "ช็อต",
		C = "ลูกเตะต้านมารยาท",
		V = "โต๊ะปาร์ตี้",
		E = "เปลวเพลิง",
		CAwake = "ลูกเตะดาวตก",
		VAwake = "กระหน่ำเตะ",
		EAwake = "เปลวเพลิงสีคราม",
		CAzure = "ดาวตกสีคราม",
		VAzure = "ลูกเตะความเร็วแสง"
	},
	Trickster = {
		Power = "หมัดลม",
		Z = "ไพ่แห่งเงามืด",
		X = "ฟาดฟันไพ่ขาวดำ",
		C = "การ์ดช่องว่าง",
		V = "สับไพ่คุมขัง",
		E = "เด็ค บลิงค์"
	},
	["Gale Fist"] = {
		Power = "หมัดลม",
		Z = "วายุหมุนปะทุ",
		X = "ทอร์นาโดคมวายุ",
		C = "หมัดพายุ",
		V = "มังกรพายุ",
		E = "พลิกพายุสวนกลับ"
	},
	["Justice Fist"] = {
		Power = "หมัดพิทักษ์",
		Z = "หมัดสัจธรรม",
		X = "หมัดเหล็กพิทักษ์",
		C = "ลูกระเบิดมฤตยู",
		V = "ทลายเอกภพ",
		E = "โซ่เกลียวพายุ"
	},
	Striker = {
		Power = "กองหน้า",
		Z = "เตะพิฆาต",
		X = "โค้งสกัด",
		C = "แข้งกระหน่ำ",
		V = "โกลาโซ่",
		E = "เลี้ยงกระชาก"
	},
	Cyborg = {
		Power = "ไซบอร์ก",
		Z = "มวยเหล็ก",
		X = "แอร์ช็อก",
		C = "ราดิคอล บีม",
		V = "โอเวอร์โหลด",
		E = "ซ่อมแซมตัวเอง",
		ZAwake = "คลื่นความเร่ง",
		XAwake = "ไฟฟ้าแรงสูง",
		CAwake = "ลำแสงทำลายล้าง",
		VAwake = "ปรับเปลี่ยนเทคนิค",
		EAwake = "ซ่อมแซมขั้นสูง"
	},
	None = {
		Power = "หมัดเริ่มต้น",
		Z = "หมัดกระทุ้ง",
		X = "หมัดหนัก",
		C = "หมัดกระหน่ำ",
		V = "หมัดพิโรธ"
	},
	WaterStyle = {
		Power = "หมัดวารี",
		Z = "อุทกสะเทือน",
		X = "ศิรากระเพื่อม",
		C = "อุทกวิถี",
		V = "ศิราภาณุ",
		ZAwake = "ห้วงลึกทะลวง",
		XAwake = "อุทกกะพินาศ",
		CAwake = "ศิราซัดคลื่น",
		VAwake = "ศิราปะทุ"
	},
	Electro = {
		Power = "สายฟ้า",
		Z = "อิเล็คโทร ช็อต",
		X = "ตบความเร็วสูง",
		C = "อิเล็คโทร แดช",
		V = "อิเล็คโทร โซน",
		ZAwake = "ไลท์นิ่ง โอเวอร์โหลด",
		XAwake = "ธันเดอร์คแล็พ",
		CAwake = "ไลท์นิ่ง แดช",
		VAwake = "ความเร็วของพระเจ้า"
	},
	DragonClaw = {
		Power = "กรงเล็บมังกร",
		Z = "กรงเล็บมังกร",
		X = "ลมหายใจมังกร",
		C = "มังกรแล่น",
		V = "พายุมังกร",
		ZAwake = "กรงเล็บแห่งความโกรธ",
		XAwake = "ลมหายใจราชามังกร",
		CAwake = "กรงเล็บมังกร",
		VAwake = "ความหายนะของมังกร"
	}
}